// --------------------------------------------------------------------
//	MSX-BASIC compiler
// ====================================================================
//	2023/July/20th  t.hara 
// --------------------------------------------------------------------

#include "basic_types.h"
#include "basic_list.h"
#include "error_list.h"
#include "variable_info.h"
#include "constant_info.h"
#include "assembler/assembler_list.h"
#include "variable_manager.h"

#ifndef __COMPILE_INFO_H__
#define __COMPILE_INFO_H__

class CCOMPILE_INFO {
private:
	// ----------------------------------------------------------------
	//	自動生成ラベルのインデックス
	// ----------------------------------------------------------------
	int					auto_label_index;

public:
	CCOMPILE_INFO(): auto_label_index(0) {
	}

	class CCOMPILER		*p_compiler = nullptr;

	// ----------------------------------------------------------------
	//	BASICのソースコードとその参照位置を保持
	// ----------------------------------------------------------------
	CBASIC_LIST			list;

	// ----------------------------------------------------------------
	//	変数を保持
	// ----------------------------------------------------------------
	CVARIABLE_INFO		variables;

	// ----------------------------------------------------------------
	//	定数を保持
	// ----------------------------------------------------------------
	CCONSTANT_INFO		constants;

	// ----------------------------------------------------------------
	//	発見した全てのエラーを保持
	// ----------------------------------------------------------------
	CERROR_LIST			errors;

	// ----------------------------------------------------------------
	//	コンパイル結果を保持
	// ----------------------------------------------------------------
	CASSEMBLER_LIST		assembler_list;

	// ----------------------------------------------------------------
	//	コンパイルオプションを保持
	// ----------------------------------------------------------------
	COPTIONS			options;

	// ----------------------------------------------------------------
	//	変数の管理
	// ----------------------------------------------------------------
	CVARIABLE_MANAGER	variable_manager;

	// ----------------------------------------------------------------
	//	ラベルの自動生成
	// ----------------------------------------------------------------
	std::string get_auto_label( void ) {
		std::string s;
		s = "_pt" + std::to_string( this->auto_label_index );
		this->auto_label_index++;
		return s;
	}

	// ----------------------------------------------------------------
	//	FOR文のループ変数スタック
	// ----------------------------------------------------------------
	std::vector< CVARIABLE > for_variable_array;

	// ----------------------------------------------------------------
	//	割り込み処理の利用フラグ
	// ----------------------------------------------------------------
	bool use_on_interval = false;
	bool use_on_strig = false;
	bool use_on_sprite = false;
	bool use_on_key = false;
	bool use_on_stop = false;
	bool use_return_line_no = false;

	bool is_interrupt_use( void ) const {
		return( this->use_on_interval || this->use_on_strig || this->use_on_sprite || this->use_on_key || this->use_on_stop );
	}
};

// --------------------------------------------------------------------
class CCOMPILER_CONTAINER {
public:
	// ----------------------------------------------------------------
	//	このコンテナが対応する記述だけをコンパイルする
	//	このコンテナが対応する記述だった場合は、true を返す
	virtual bool exec( CCOMPILE_INFO *p_info ) = 0;
};

#endif
