// --------------------------------------------------------------------
//	MSX-BASIC compiler
// ====================================================================
//	2023/July/20th  t.hara 
// --------------------------------------------------------------------

#include "basic_types.h"
#include "basic_list.h"
#include "error_list.h"
#include "variable_info.h"

#ifndef __COMPILE_INFO_H__
#define __COMPILE_INFO_H__

class CCOMPILE_INFO {
public:
	// ----------------------------------------------------------------
	//	BASICのソースコードとその参照位置を保持
	// ----------------------------------------------------------------
	CBASIC_LIST			list;

	// ----------------------------------------------------------------
	//	変数を保持
	// ----------------------------------------------------------------
	CVARIABLE_INFO		variables;

	// ----------------------------------------------------------------
	//	発見した全てのエラーを保持
	// ----------------------------------------------------------------
	CERROR_LIST			errors;

	// ----------------------------------------------------------------
	//	コンパイル結果を保持
	// ----------------------------------------------------------------
	std::vector< std::string > header;
	std::vector< std::string > body;
	std::vector< std::string > datas;
	std::vector< std::string > variables_area;
	std::vector< std::string > footer;
};

// --------------------------------------------------------------------
class CCOMPILER_CONTAINER {
public:
	// --------------------------------------------------------------------
	//	このコンテナが対応する記述だけをコンパイルする
	//	このコンテナが対応する記述だった場合は、true を返す
	virtual bool exec( CCOMPILE_INFO *p_info ) = 0;
};

#endif
